Autodesk.Revit.DB.MeshFromGeometryOperationResult.GetIssues
Returns the array of issues encountered while building a mesh.
Returns:
Array of issues encountered while building a mesh.
Since:
2015

Autodesk.Revit.DB.MeshFromGeometryOperationResult.GetMesh
This returns a valid mesh only for the first call. Later calls
will throw an exception as the mesh is no longer valid in this object.
Returns:
Mesh which built.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Mesh has already been accessed by a previous GetMesh() call, and is no longer available for use.
Since:
2015

Autodesk.Revit.DB.MeshFromGeometryOperationResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.MeshFromGeometryOperationResult.IsMeshAvailable
Shows whether the result still contains the mesh
which was constructed, if any, or whether it has been
relinquished by 'getMesh'.
The former is true, the later is false.
Since:
2015

Autodesk.Revit.DB.MeshFromGeometryOperationResult.Tessellated
Whether while constructing a mesh, it was necessary
to extrude polylines instead of non-linear curves
from the profile loops.
Since:
2015

Autodesk.Revit.DB.MeshFromGeometryOperationResult.HasInvalidData
Whether the provided data for which this result was
obtained were internally inconsistent and could not be
used in its entirety. For example, for extrusion
operation, profile loops were degenerate
or improperly oriented with respect to the extrsuion
direction.
Remarks:
This variable does not capture presence or absence
of intersections between different profile loops.
Since:
2015

Autodesk.Revit.DB.MeshFromGeometryOperationResult
Describes what TessellatedShapeBuilder has
built.
Since:
2015